#!/usr/local/bin/lua
print("Hello World! ")
print("Hello China! ")
--Á½¸ö¼õºÅÊÇµ¥ĞĞ×¢ÊÍ
--[[ ¶àĞĞ×¢ÊÍ
¶àĞĞ×¢ÊÍ
¶àĞĞ×¢ÊÍ
--]]
--Ê¹ÓÃ±êÊ¶·ûÊ±×îºÃ²»ÒªÓÃÏÂ»®Ïß¼Ó´óĞ´×ÖÄ¸µÄ±êÊ¶·û¡£
--LuaÓïÑÔÊÇÒ»¸öÇø·Ö´óĞ¡Ğ´µÄ±à³ÌÓïÑÔ
--[[
¹Ø¼ü´Ê
ÒÔÏÂÁĞ³öÁË Lua µÄ±£Áô¹Ø¼ü×Ö¡£±£Áô¹Ø¼ü×Ö²»ÄÜ×÷Îª³£Á¿»ò±äÁ¿»òÆäËûÓÃ»§×Ô¶¨Òå±êÊ¾·û£º
and break
do else elseif end false
for function if
in  local  nil not or repeat
return then  true  until while

Ò»°ãÔ¼¶¨£¬ÒÔÏÂ»®Ïß¿ªÍ·Á¬½ÓÒ»´®´óĞ´×ÖÄ¸µÄÃû×Ö£¨±ÈÈç _VERSION£©±»±£ÁôÓÃÓÚ Lua ÄÚ²¿È«¾Ö±äÁ¿¡£
--]]
--Ä¬ÈÏÇé¿öÏÂ£¬±äÁ¿×ÜÈÏÎªÊÇÈ«¾ÖµÄ£¬Ò²¾ÍÊÇËµ¸øÒ»¸ö±äÁ¿¸³Öµºó¼´´´½¨ÁËÕâ¸öÈ«¾Ö±äÁ¿¹ı
--·ÃÎÊÃ»ÓĞ³õÊ¼»¯µÄÈ«¾Ö±äÁ¿µÃµ½µÄ½á¹ûÊÇ£ºnil
print(b)
b=10;
print(b)
--ÒªÉ¾³ıÒ»¸öÈ«¾Ö±äÁ¿Ö»ĞèÒª½«±äÁ¿¸³ÖµÎªnil;



--[[Êı¾İÀàĞÍ
1.nil
2.boolean (°üº¬£ºfasle true)
3.number (°üº¬Ë«¾«¶ÈÀàĞÍºÍÊµ¸¡µãÊı£©
4.string
5.function (ÓÉC»òLua±àĞ´µÄº¯Êı)
5.userdata (±íÊ¾ÈÎÒâ´æ´¢ÔÚ±äÁ¿ÖĞµÄCÊı¾İ½á¹¹)
6.thread (±íÊ¾Ö´ĞĞµÄ¶ÀÁ¢Â·Ïß£¬ÓÃÓÚÖ´ĞĞĞ­Í¬³ÌĞò)
7.table (±í £¬ÆäÊµÊÇÒ»¸ö¹ØÁªÊı×é)
--]]
print(type("Hello world!"))
print()type(10.4*3)
print(type(print))
--¿ÉÒÔÓÃ[[ ]]±íÊ¾×Ö·û¿é
html = [[
<html>
<head></head>
<body>
    <a href="http://www.runoob.com/">²ËÄñ½Ì³Ì</a>
</body>
</html>
]]
print(html)





--ÔÚ¶ÔÒ»¸öÊı×Ö×Ö·û´®ÉÏ½øĞĞËãÊõ²Ù×÷Ê±£¬Lua »á³¢ÊÔ½«Õâ¸öÊı×Ö×Ö·û´®×ª³ÉÒ»¸öÊı×Ö
--ÀıÈç
string1="1"+2;
print(type(string1));






--Ê¹ÓÃ#À´¼ÆËã×Ö·û´®µÄ³¤¶È£¬·ÅÔÚ×Ö·û´®µÄÇ°Ãæ
string3="hello world!";
print(#string3);




--×¢Òâ£º  ÔÚLua ÓïÑÔÖĞ£¬Êı×éµÄÄ¬ÈÏ³õÊ¼Ë÷ÒıÒ»°ãÒÔ1 ¿ªÊ¼
--table ²»»á¹Ì¶¨³¤¶È´óĞ¡£¬ÓĞĞÂÊı¾İÌí¼ÓÊ±table³¤¶È»á×Ô¶¯Ôö³¤£¬Ã»³õÊ¼µÄtable¶¼ÊÇnil



--×¢Òâ£ºLuaÖĞÇå¿ÕÆÁÄ»µÄ·½Ê½£ºÊäÈë os.execute("cls")



--ÔÚLuaÖĞ¡£º¯ÊıÊÇ±»¿´×÷ÊÇµÚÒ»ÀàÖµ£¨first-class value)
--º¯Êı¿ÉÒÔ´æÔÚ±äÁ¿Àï  ÊµÀı£º
function factorial1(n)
if n==0 then
return 1
else
return n*factorial1(n-1)
end
end
print(factorial1(5))
factorial2=factorial1
print(factoraial2(5))


--[[LuaµÄ±äÁ¿ÓĞÈıÖÖÀàĞÍ£ºÈ«¾Ö£¬¾Ö²¿£¬±íÖĞµÄÓò
LuaÖĞµÄ±äÁ¿È«²¿ÎªÈ«¾Ö±äÁ¿ ,ÄÄÅÂÊÇÓï¾ä¿é»òÊÇº¯ÊıÀï£¬³ı·ÇÓÃlocalÏÔÊ½µÄÉùÃ÷¾Ö²¿±äÁ¿
¾Ö²¿±äÁ¿µÄ×÷ÓÃÓòÎª´ÓÉùÃ÷Î»ÖÃ¿ªÊ¼µ½ËùÔÚÓï¾ä¿é½áÊø¡£
±äÁ¿µÄÄ¬ÈÏÖµ¾ùÎª nil¡£
--]]


--¸³ÖµÓï¾ä
a="hello".."world"
t=.n=t.n+1
--»¹¿ÉÒÔÍ¬Ê±¶à¸ö¸³Öµ

a,b=10,2*x;--µÈ¼ÛÓÚ£ºa=10;b=2*x;
--µ±Óöµ½¸³ÖµÓï¾ä»á¼ÆËãÓÒ±ßµÄÖµÈ»ºóÖ´ĞĞ¸³Öµ²Ù×÷£¬Èç£º
x,u=y,x;--swap'x'for'y'
µ±±äÁ¿ºÍÊıÖµµÄ¸öÊı²»Ò»ÖÂÊ±£¬Lua»áÒ»Ö±ÒÔ±äÁ¿¸öÊıÎª»ù´¡²ÉÈ¡Ò»ÏÂ´ëÊ©£º
a. ±äÁ¿¸öÊı>ÖµµÄ¸öÊı       °´±äÁ¿¸öÊı²¹×ãnil
b.±äÁ¿¸öÊı<ÖµµÄ¸öÊı        ¶àÓàµÄÖµ»á±»ºöÂÔ

--¶àÖµ¸³Öµ¾­³£ÓÃÀ´½»»»±äÁ¿£¬»ò½«º¯Êıµ÷ÓÃ·µ»Ø¸ø±äÁ¿
a,b=f()

--Ó¦µ±¾¡¿ÉÄÜµÄÊ¹ÓÃ¾Ö²¿±äÁ¿£¬ÓĞÁ½¸öºÃ´¦
--1.±ÜÃâÃüÃû³åÍ»
--2.·ÃÎÊ¾Ö²¿±äÁ¿µÄËÙ¶È±ÈÈ«¾Ö±äÁ¿¸ü¿ì






--Lua Ñ­»·


--ËÄÖÖ·½Ê½  £º
--while Ñ­»·  for Ñ­»·
--repeat   until
--Ñ­»·Ç¶Ì×  ¿ÉÒÔÔÚÑ­»·Ç¶Ì×ÄÚÇ¶Ì×Ò»¸ö»ò¶à¸öÑ­»·Óï¾ä£¨while do ....end;  for... do...end;repeat....until;£


--LuaÖ§³ÖbreakÓï¾ä£¬ÍË³öµ±Ç°Ñ­»·»òÓï¾ä



--ÎŞÏŞÑ­»·
while(true)
do
print ("Ñ­»·ÎŞÏŞ")
end;




--[[Lua Á÷³Ì¿ØÖÆ   (ÀûÓÃfalse true  ÅĞ¶Ï)
¿ØÖÆ½á¹¹µÄÌõ¼ş±í´ïÊ½½á¹û¿ÉÒÔÊÇÈÎºÎÖµ£¬LuaÈÏÎªfalse ºÍnil Îª¼Ù£¬true



Ìá¹©ÁË  £º if Óï¾ä
			if else  Óï¾ä
			if Ç¶Ì×Óï¾ä
--]]



--[[  Luaº¯Êı
Àı£º±È½ÏÁ½¸öÊıµÄ´óĞ¡
function max(num1,num2)
if(num1>num2) then
result=num1;
else
result=num2;
end
return result;
end

¿É½«º¯Êı×÷Îª²ÎÊı´«µİ¸øº¯Êı
¿ÉÒÔ·µ»Ø¶à¸ö·µ»ØÖĞ
¿ÉÒÔ½ÓÊÜ¿É±äÊıÄ¿µÄ²ÎÊı£¬ºÍCÓïÑÔÀàËÆ£¬ÔÚ²ÎÊıÁĞ±íÖĞÊ¹ÓÃ...±íÊ¾º¯ÊıÓĞ¿É±äµÄ²ÎÊı¡£ÊµÀı£º

function average(...)
   result = 0
   local arg={...}    --> arg ÎªÒ»¸ö±í£¬¾Ö²¿±äÁ¿
   for i,v in ipairs(arg) do
      result = result + v
   end
   print("×Ü¹²´«Èë " .. #arg .. " ¸öÊı")
   return result/#arg
end

print("Æ½¾ùÖµÎª",average(10,5,3,4,5,6))

ÓĞÊ±»áĞèÒª¼¸¸ö¹É¶«²ÎÊı¼ÓÉÏ¿É±ä²ÎÊı£¬×¢Òâ£º¹Ì¶¨²ÎÊı±ØĞë·ÅÔÚ¿É±ä²ÎÊıÖ®Ç°
--]]
